Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::ReferenceSetBase::Modifier Class Reference
MEP Element Manager
Modifier of the ReferenceSetBase. More...
#include <MEPReferenceSetBase.hpp>
 Inheritance diagram for ACAPI::MEP::ReferenceSetBase::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &referenceSetName)
Sets the name of the referenceSet.
Result< uint32_t >  | Add (uint32_t id)
Adds a new referenceId into the referenceSet. If the id is a duplicate, it will not be inserted twice.
Result< void >  | Delete (uint32_t id)
Deletes an entry from the referenceSet. Only undefined referenceIds can be deleted. A referenceId is defined if at least one preferenceTable has values associated to it.
 Protected Member Functions
Modifier (ReferenceSetBase &parent)
Constructs a Modifier with the given referenceSetBase.
Detailed Description
Modifier of the ReferenceSetBase.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::ReferenceSetBase::Modifier::Modifier  |  ( |  ReferenceSetBase & |  parent | )
protected
Constructs a Modifier with the given referenceSetBase.
Parameters
parent | The given parent ReferenceSetBase.
Member Function Documentation
◆ Add()
 Result< uint32_t > ACAPI::MEP::ReferenceSetBase::Modifier::Add  |  ( |  uint32_t |  id | )
Adds a new referenceId into the referenceSet. If the id is a duplicate, it will not be inserted twice.
Parameters
id | The id to be added.
Returns
Returns error if the referenceId is a duplicate, otherwise returns the index of the referenceId in the referenceSet.
◆ Delete()
 Result< void > ACAPI::MEP::ReferenceSetBase::Modifier::Delete  |  ( |  uint32_t |  id | )
Deletes an entry from the referenceSet. Only undefined referenceIds can be deleted. A referenceId is defined if at least one preferenceTable has values associated to it.
Parameters
id | The id to be deleted.
Returns
Returns error if the id cannot be deleted due to reasons mentioned above, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::ReferenceSetBase::Modifier::SetName  |  ( |  const GS::UniString & |  referenceSetName | )
Sets the name of the referenceSet.
Parameters
referenceSetName | The name to be set.